{
  "sections": [
    "assessment",
    "samples",
    "concepts",
    "background",
    "lesson",
    "references",
    "exercises"
  ],
  "descriptions": {
    "assessment": "HTML formatted Summary of assessment performance and overall outcomes for the set of questions. We want to see patterns in the data and identify which concepts are most difficult for the child. Also describe the child's strengths and weaknesses. Include samples from the uploaded report as evidence for the conclusions we are making. Dont provide the heading 'Assessment'.",
    "samples": "HTML formatted 2-5 example questions of each type (covering concepts above) that the child got wrong. This will be used by the tutor and also by the AI Agent to produce lessons around the questions the child got incorrect. These questions should be representative of the child's weaknesses. Dont provide the heading 'Samples'.",
    "concepts": "HTML formatted Key concepts that were covered by these questions, based upon various categories of questions. This will be used by the tutor to know what to teach, particularly which concepts were missing. Dont provide the heading 'Concepts'.",
    "background": "HTML formatted Information about the child, their known history, learning patterns, concerns, etc. We will also discover their interests such as cartoon characters, games, etc. This will be used to produce lessons and questions that attract the child's attention and interest. Dont provide the heading 'Background'.",
    "lesson": "HTML formatted The main lesson content and explanations tailored to the learner given the background we have captured before. This will be used by the tutor to know what to teach, particularly which concepts were missing. We want to make the lesson engaging and interesting for the child, and to help them understand the concepts in a way that is easy to follow and remember. Dont provide the heading 'Lesson'.",
    "references": "HTML formatted Supporting references, links, or sources for the lesson material. This will be used by the child to strengthen their understanding of the concepts in the lesson through various readings, videos, games, etc. Dont provide the heading 'References'.",
    "exercises": "Strcitly JSON formatted Practice problems to reinforce the lesson concepts. Exact format - [{type - mcq or fib, questionHtml, [answerText]}] is the format. No other fields. These will follow the same pattern as the original questions but with different numbers and values. This will be used by the child to reinforce their understanding of the concepts in the lesson. Again, we want to use the information captured in the background section to create exercises that are appropriate for the child's level and interests. Dont provide the heading 'Exercises'."
  }
}
